OpenFOAM-6-master/tutorials/lagrangian/MPPICFoam/cyclone/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

cp $FOAM_TUTORIALS/resources/geometry/cyclone.stl.gz constant/triSurface

runApplication blockMesh

runApplication snappyHexMesh -overwrite

runApplication decomposePar

runParallel MPPICFoam

#------------------------------------------------------------------------------
